import { Synod } from './../../synodrule.model';
import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-accordion-homepage',
  templateUrl: './accordion-homepage.component.html',
  styleUrls: ['./accordion-homepage.component.css']
})
export class AccordionHomepageComponent implements OnInit {

  constructor() { }

  ngOnInit(): void {
  }
  AccordionObj=[
    {title:'اعلانات يومية',body:'اعلانات يومية اعلانات يوميةاعلانات يوميةاعلانات يوميةاعلانات يوميةاعلانات يوميةاعلانات يوميةاعلانات يوميةاعلانات يوميةاعلانات يوميةاعلانات يوميةاعلانات يوميةاعلانات يوميةاعلانات يومية'},
    {title:'اخبار كنسية',body:' كنسيةاغبار كنسيةاغبار كنسيةاغبار كنسيةاغبار كنسيةاغبار كنسيةاغبار كنسيةاغبار كنسيةاغبار كنسيةاغبار كنسيةاغبار كنسيةاغبار كنسيةاغبار كنسيةاغبار كنسية'},
    {title:'اعلانات مبوبة',body:'اعلانات موبوبةاعلانات موبوبةاعلانات موبوبةاعلانات موبوبةاعلانات موبوبةاعلانات موبوبةاعلانات موبوبةاعلانات موبوبةاعلانات موبوبةاعلانات موبوبةاعلانات موبوبةاعلانات موبوبةاعلانات موبوبةاعلانات موبوبةاعلانات موبوبةاعلانات موبوبةاعلانات موبوبةاعلانات موبوبةاعلانات موبوبةاعلانات موبوبةاعلانات موبوبةاعلانات موبوبةاعلانات موبوبة'},
    {title:'معلومات طقسية',body:'معلومات طقسيةمعلومات طقسيةمعلومات طقسيةمعلومات طقسيةمعلومات طقسيةمعلومات طقسيةمعلومات طقسيةمعلومات طقسيةمعلومات طقسيةمعلومات طقسية'}
  ];

  sr:Synod[]=[
    new Synod('القرارات بخصوص .....','القرااااار القرااار قرااار'),
    new Synod('القرارات بخصوص .....','القرااااار القرااار قرااار')
  ]

  Katamaras=[
    {title:'مزمور عشية',body:''},{title:'انجيل العشية ',body:''},  
    {title:'مزمور باكر',body:''},{title:'انجيل باكر',body:''},   
    {title:'البولس',body:''},{title:'الكاثوليكون',body:''},   
    {title:'الابراكسيس',body:''},{title:'السنكسار',body:''},   
    {title:'مزمور القداس',body:''},
    {title:'انجيل القداس',body:''}
  ]

  LinkStyle(){
    return 'text-decoration: none;';
  }
}
